# NotEnoughRoomForParallelConduits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..NotEnoughRoomForParallelConduits Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotEnoughRoomForParallelConduits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotEnoughRoomForParallelConduits As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotEnoughRoomForParallelConduits {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace